# Проект с коллекцией алгоритмических задач на C#

Этот проект содержит 7 различных программ на C#, каждая из которых решает определенную алгоритмическую задачу.

## Содержание
1. [Вычисление e^x через ряд Маклорена](#1-вычисление-ex-через-ряд-маклорена)
2. [Проверка счастливого билета](#2-проверка-счастливого-билета)
3. [Сокращение дробей](#3-сокращение-дробей)
4. [Угадывание числа](#4-угадывание-числа)
5. [Кофейный аппарат](#5-кофейный-аппарат)
6. [Моделирование бактерий и антибиотика](#6-моделирование-бактерий-и-антибиотика)
7. [Расчет защиты для марсианских модулей](#7-расчет-защиты-для-марсианских-модулей)
8. [Рекомендации по использованию](#8-рекомендации-по-использованию)
9. [Типичные ошибки программиста](#9-типичные-ошибки-программиста)

---

## 1. Вычисление e^x через ряд Маклорена

**Основные функции:**
- Предварительное вычисление факториалов для оптимизации
- Вычисление суммы ряда Маклорена с заданной точностью
- Сравнение с встроенной функцией Math.Exp()
- Анализ отдельных членов ряда

**Тестовые данные:**
```
Входные данные:
x = 1, точность = 0.0001

Выходные данные:
Вычисленное значение: 2.718279
Math.Exp(1): 2.718282
Разница: 2.78E-06
Количество итераций: 9
```

---

## 2. Проверка счастливого билета

**Основные функции:**
- Проверка корректности ввода шестизначного числа
- Разбиение числа на цифры
- Сравнение сумм первых и последних трех цифр

**Тестовые данные:**
```
Входные данные: 123321

Выходные данные: 
Билет счастливый!

Входные данные: 123456

Выходные данные:
Билет обычный.
```

---

## 3. Сокращение дробей

**Основные функции:**
- Ввод числителя и знаменателя в одной строке
- Нахождение НОД с помощью рекурсивного алгоритма Евклида
- Корректная обработка отрицательных чисел
- Упрощение дроби до несократимого вида

**Тестовые данные:**
```
Входные данные: 24 36

Выходные данные: 2/3

Входные данные: -15 25

Выходные данные: -3/5

Входные данные: 7 1

Выходные данные: 7
```

---

## 4. Угадывание числа

**Основные функции:**
- Алгоритм бинарного поиска для минимизации количества вопросов
- Проверка корректности ввода ответов (только 0 или 1)
- Подсчет количества заданных вопросов

**Тестовые данные:**
```
Загаданное число: 42

Пример диалога:
Ваше число больше 31? (1/0): 1
Ваше число больше 47? (1/0): 0
Ваше число больше 39? (1/0): 1
...
Результат: Я угадал число за 6 вопросов!
```

---

## 5. Кофейный аппарат

**Основные функции:**
- Инициализация запасов воды и молока
- Приготовление двух видов напитков: Американо и Латте
- Проверка достаточности ингредиентов
- Учет статистики и доходов
- Автоматическое завершение при недостатке ингредиентов

**Тестовые данные:**
```
Входные данные:
Вода: 1000 мл, Молоко: 500 мл

Пример работы:
Приготовлено 2 американо и 1 латте
Остаток воды: 340 мл, молока: 230 мл
Итоговый заработок: 470 руб.
```

---

## 6. Моделирование бактерий и антибиотика

**Основные функции:**
- Моделирование экспоненциального роста бактерий
- Динамическое уменьшение эффективности антибиотика
- Почасовой вывод состояния системы
- Анализ конечного результата

**Тестовые данные:**
```
Входные данные:
Начальное количество бактерий: 10
Количество капель антибиотика: 2

Пример вывода:
Час 1: Бактерий = 10, Убито = 20, Эффективность = 10
Час 2: Бактерий = 0, Убито = 18, Эффективность = 9
Результат: Антибиотик победил все бактерии!
```

---

## 7. Расчет защиты для марсианских модулей

**Основные функции:**
- Бинарный поиск оптимальной толщины защиты
- Проверка возможности размещения модулей в двух ориентациях
- Обработка различных размеров модулей и поля
- Определение максимально возможной защиты

**Тестовые данные:**
```
Входные данные:
Количество модулей: 5
Размеры модуля: 2 3
Размеры поля: 9 9

Выходные данные:
Максимальная толщина защиты: 1

Объяснение:
С защитой толщиной 1 размер модуля становится 4×5,
на поле 9×9 можно разместить 4 модуля (2×2 компоновка)
```

---

## 8. Рекомендации по использованию

### Для обучающихся:
- **Начинающим**: Изучайте задачи в порядке их сложности (от 1 к 7)
- **Средний уровень**: Анализируйте алгоритмы и попробуйте их оптимизировать
- **Продвинутые**: Реализуйте дополнительные функции и улучшите обработку ошибок

### Для преподавателей:
- Используйте задачи как практические задания по соответствующим темам
- Задача 1 - ряды и численные методы
- Задача 2 - работа с числами и строками
- Задача 3 - алгоритмы и математика
- Задача 4 - алгоритмы поиска
- Задача 5 - ООП и бизнес-логика
- Задача 6 - математическое моделирование
- Задача 7 - оптимизация и геометрия

### Практическое применение:
- Задача 1: Финансовые расчеты, научные вычисления
- Задача 2: Алгоритмы проверки данных
- Задача 3: Математические библиотеки
- Задача 4: Алгоритмы искусственного интеллекта
- Задача 5: Системы автоматизации бизнеса
- Задача 6: Медицинское моделирование
- Задача 7: Оптимизация размещения объектов

---

## 9. Типичные ошибки программиста

### Общие ошибки для всех задач:

**1. Отсутствие валидации входных данных**
```csharp
// ПЛОХО
int number = int.Parse(Console.ReadLine());

// ХОРОШО
if (!int.TryParse(Console.ReadLine(), out int number))
{
    Console.WriteLine("Ошибка ввода!");
    return;
}
```

**2. Игнорирование граничных условий**
```csharp
// ПЛОХО - может привести к делению на 0
int result = a / b;

// ХОРОШО
if (b == 0) 
{
    Console.WriteLine("Деление на ноль невозможно!");
    return;
}
```

### Ошибки в численных алгоритмах (Задача 1, 6):

**3. Накопление ошибок округления**
```csharp
// ПЛОХО - использование float для точных вычислений
float sum = 0.0f;

// ХОРОШО
double sum = 0.0;
```

**4. Бесконечные циклы**
```csharp
// ПЛОХО - нет защиты от бесконечного цикла
while (Math.Abs(term) > precision)
{
    // вычисления...
}

// ХОРОШО
int maxIterations = 1000;
int iterations = 0;
while (Math.Abs(term) > precision && iterations < maxIterations)
{
    // вычисления...
    iterations++;
}
```

### Ошибки в алгоритмах поиска (Задача 4, 7):

**5. Неправильная реализация бинарного поиска**
```csharp
// ПЛОХО - может привести к зацикливанию
int mid = (left + right) / 2;

// ХОРОШО
int mid = left + (right - left) / 2;
```

**6. Переполнение целочисленных типов**
```csharp
// ПЛОХО - переполнение при больших значениях
int total = horizontalModules * verticalModules;

// ХОРОШО
long total = (long)horizontalModules * verticalModules;
```

### Ошибки в бизнес-логике (Задача 5):

**7. Отсутствие проверки на отрицательные значения**
```csharp
// ПЛОХО
water -= AMERICANO_WATER;

// ХОРОШО
if (water >= AMERICANO_WATER)
{
    water -= AMERICANO_WATER;
}
else
{
    Console.WriteLine("Недостаточно воды!");
}
```

**8. Плохая структура кода**
```csharp
// ПЛОХО - вся логика в Main()
// ХОРОШО - разделение на методы и классы
```

### Ошибки в математических алгоритмах (Задача 3):

**9. Неправильная работа с отрицательными числами**
```csharp
// ПЛОХО - НОД для отрицательных чисел
static int GetGCD(int a, int b)
{
    // может вернуть отрицательное число
}

// ХОРОШО
static int GetGCD(int a, int b)
{
    a = Math.Abs(a);
    b = Math.Abs(b);
    // вычисления...
}
```

### Советы по избежанию ошибок:

1. **Всегда проверяйте входные данные**
2. **Тестируйте граничные случаи**
3. **Используйте значимые имена переменных**
4. **Комментируйте сложные алгоритмы**
5. **Пишите модульные тесты**
6. **Обрабатывайте исключительные ситуации**
7. **Следите за переполнением числовых типов**
8. **Избегайте магических чисел - используйте константы**

---

## Требования
- .NET Framework или .NET Core
- Совместимая среда выполнения C#

## Использование
Каждая программа является самостоятельным приложением. Для запуска скомпилируйте и запустите соответствующий файл .cs или соберите весь проект.